import React, { useContext } from "react";
import { MdKeyboardArrowRight } from "react-icons/md";
import { ThemeContext } from "../../App";
const History = () => {
  const { theme, toggleTheme } = useContext<any>(ThemeContext);
  return (
    <>
      <div
        className={`${
          theme === "light"
            ? "bg-[#166364]  border-t border-[#e4e6eb]"
            : "bg-gray-700"
        }`}
      >
        <div className="h-52   max-w-7xl m-auto px-3 grid grid-cols-1 lg:flex justify-between items-center">
          <h1 className="text-4xl  font-medium text-white up">
            History of Collage
          </h1>

          <div
            className={`flex py-2 ]  px-8 gap-5 rounded-lg  font-medium ${
              theme == "light"
                ? "bg-[#23395b] text-white"
                : "bg-[#242526] text-[#e4e6eb]"
            }`}
          >
            <div className=" flex gap-2">
              {" "}
              <span className="px-0">Home </span>
              <span className="mt-1 text-xl text-white">
                <MdKeyboardArrowRight />
              </span>
            </div>
            <div className="flex gap-2">
              {" "}
              <span className="px-0">About</span>
              <span className="mt-1 text-xl text-white">
                <MdKeyboardArrowRight />
              </span>
            </div>

            <span className="text-white font-medium">History</span>
          </div>
        </div>
      </div>

      <div className="px-3">
        <div
          className={`card  lg:w-full w-[280px] max-w-7xl mx-auto p-5 border  shadow-md my-20 ${
            theme == "light"
              ? "bg-base-100"
              : "bg-[#242526] text-[#e4e6eb] border-[#414343]"
          }`}
        >
          <p className="text-2xl font-medium text-center mt-5">
            কলেজের সংক্ষিপ্তি ইতিহাস
          </p>
          <p
            className={`mt-5 leading-loose ${
              theme == "light" ? " text-gray-700" : " text-[#e4e6eb] "
            }`}
          >
            ১০৫৪ সালে তৎকালীন এম.এল.এ অধ্যাপক আসহাব উদ্দীন, শিক্ষানুরাগী জনাব
            বাদশঅ মিঞা চৌধুরী ও জনাব আলী মুহাম্মদ মাস্টার প্রমুখের উদ্যোগে
            বেসরকারী চেষ্ঠায় প্রতিষ্ঠিত হয় ‘চট্টগ্রাম নাইট কলেজ’। কলেজের প্রথম
            অধ্যক্ষ শ্রী যোগেশ চন্দ্র সিনহা এম.এ(ইংরেজি)-র হাত ধরে সিটি কলেজের
            পথচলা শুরু হয়। ১৯৬২ সালে দিবা শাখা খোলার মাধ্যমে ‘সিটি কলেজ,
            চট্টগ্রাম’ সামে নিজস্ব জায়গায়, নিজস্ব ভবনে আইস ফ্যাক্টরী রোডের পাশে
            (নিউ মার্কেটের দক্ষিণে) বর্তমান স্থানে কার্যক্রম শুরু হয়। ১৯৭৯ সালে
            জাতীয়করণের মাধ্যমে ‘সিটি কলেজ’ সরকারি সিটি কলেজ, চট্টগ্রাম হিসাবে
            প্রতিষ্ঠা লাভ করে। বহু পথপরিক্রমায় আজ এ কলেজ দেশের অন্যতম বৃহৎ এবং
            একমাত্র দুই শীফটের কলেজ হিসেবে আত্মপ্রকাশ করেছে। এইচএসসি,
            ডিগ্রি(পাস), ১৫টি বিষয়ে অনার্স এবং ১৫টি বিষয়ে মাস্টার্সসহ সকল কোর্সে
            প্রায় ১৮০০০ শিক্ষার্থী এবং প্রায় ১২৮ জন শিক্ষকের পদচারণায় মুখরিত এই
            কলেজ দেশে অন্যতম আদর্শ বিদ্যাপীঠ। এ কলেজকে সচল রাখার কাজে প্রায় ৮০
            জন কর্মচারী সদা নিয়োজিত আছেন। বর্তমানে কলেজের মূল ক্যাম্পাসে
            বেসরকারী আমলের তিনটি ভবন রয়েছে। (প্রশাসনিক ভবন ৫তলা, পূর্ব ভবন ৪তলা,
            পশ্চিম ভবন ৪তলা) সরকারীকরণের পর 2000 সালে একটি ৫তলা নতুন ভবন নির্মিত
            হয়। বর্তমান ২০২০ সালে দুটি ৫তলা একাডেমিক ভবন নির্মিত হয়, যা দক্ষিণ
            ভবন-১ ও দক্ষিণ ভবন-২ নামে পরিচিত এবং একটি ১০তলা প্রশাসনিক ভবনের
            নির্মাণ কাজ এগিয়ে চলছে। আধুনিক স্থাপত্যকলায় নির্মিত এ কলেজ
            ক্যাম্পাসে রয়েছে ত্রিতল জামে মসজিদ। এছাড়া কলেজ ক্যাম্পাস থেকে প্রায়
            ৪০০ মিটার দুরে দারোগা হাট রোডে রয়েছে ৪ তলা মা আমিনা (রাঃ)
            ছাত্রীনিবাস ও আরেকটি 5 তলা ছাত্রীনিবাসের নির্মাণ কাজ প্রায় শেষ
            পর্যায়ে এবং কাজী নজরুল ইসলাম সড়কে রয়েছে স্টাফ কোয়াটার। দিবা ও
            বৈকালিক শীফটে একাডেমিক কার্যকমের সাথে সহপাঠ্যক্রম হিসাবে
            বি.এন.সি.সি., রেঞ্জার গাইড, যুব রেডক্রিসেন্ট ও রোভার স্কাউট-এর
            কার্যক্রম চালু আছে। বাংলাদেশ উম্মুক্ত বিশ্ববিদ্যালয়ের স্টাডি সেন্টার
            হিসাবে এ কলেজে উক্ত বিশ্ববিদ্যালয়ের চলমান কোর্সসমূহ পরিচালিত হয়ে
            আসছে। এছাড়া এ কলেজে সাহিত্য, সংস্কৃতি ও ক্রীড়া প্রতিযোগিতাসহ
            নানামুখী সহশিক্ষা কার্যক্রম পরিচালিত হয়। পাশাপাশি ছাত্র-শিক্ষক
            সমন্বয়ে সেমিনার, কর্মশালা ইত্যাদির আয়োজন করে থাকে। শিক্ষা
            মন্ত্রণালয়ের নির্দেশনায় ছাত্র-শিক্ষক-কর্মচারী সমন্বয়ে বিপুল উৎসাহ
            উদ্দীপনায় জাতীয় দিবসসমূহ পালিত হয়। ১৯৭১সালের মুক্তিযুদ্ধে এ কলেজের
            অবদান অবিস্মরণীয়। কলেজের অগণিত ছাত্র শিক্ষক কর্মচারী জীবন বাজি রেখে
            স্বাধীনতার মহান মুক্তিযুদ্ধে নিজেদের যুক্ত করেছিল। দেশ মাতৃকার
            স্বাধীনতার লাল সূর্য ছিনিয়ে আনতে গিয়ে তৎকালীন চট্টগ্রাম ইঞ্জিনিয়ারিং
            কলেজ (বর্তমান চুয়েট)-এর অদুরে পাক হানাদারদের সাথে সম্মুখ সমরে নিজের
            জীবন উৎসর্গ করেন সিটি কলেজের তৎকালীন ছাত্র ও ছাত্র সংসদের জিএসি
            এ.জি.এস সাইফুদ্দিন খালেদ। স্বৈরাচার ও সাম্প্রদায়িকতা বিরোধী আন্দোলনে
            সরকারি সিটি কলেজের ছাত্র সমাজের অবদান অপরিসীম। শিক্ষা ও মুক্তবুদ্ধির
            চর্চা কেন্দ্র হিসেবে বর্তমান এই কলেজে ছাত্র শিক্ষক কর্মচারী সমন্বয়ে
            চমৎকার সুন্দর পরিবেশ বিরাজ করছে।
          </p>
        </div>
      </div>
    </>
  );
};

export default History;
