import React from "react";

const AboutUs = () => {
  return (
    <div className="my-20 max-w-7xl m-auto px-3 ">
    
     <h1 className="text-center text-3xl font-medium">ABOUT US</h1>
   
      <div className=" grid lg:grid-cols-2 grid-cols-1 gap-5  mt-10">
        <div className=" flex  items-center">
          <img
            className="w-[450px]"
            src="assets/picture/104879-kids.gif"
            alt=""
          />
        </div>
        <div className="w-full px-4 ">
          <div
            tabIndex={0}
            className="collapse collapse-open border border-base-300 bg-base-100 rounded-box"
          >
            <div className="collapse-title text-xl font-medium">
              Focus me to see content
            </div>
            <div className="collapse-content">
              <p>
                ১৯৪৭ সালে দেশ বিভাগের পর কলকাতার ‘দি কমার্শিয়াল ইনস্টিটিউট’-এর
                এক চতুর্থাংশ হিস্যা পাকিস্তানে স্থানান্তরিত হলে সেটির দায়িত্ব
                প্রফেসর আবদুস সামাদ-কে দেওয়া হয়। তিনি অনেক চিন্তা-ভাবনা করে
                অবশেষে নবগঠিত পূর্ব পাকিস্তানের বাণিজ্য নগরী চট্টগ্রামকে বেছে
                নেন। কমার্শিয়াল ইনস্টিটিউটের ভাগে পাওয়া টাইপ রাইটার, বই, ফাইল
                এবং অন্যান্য যন্ত্রপাতি নিয়ে তিনি চট্টগ্রামের উদ্দেশ্যে রওনা
                হন। চট্টগ্রামে এসে প্রফেসর সামাদ কোথায় এটি স্থাপন করা যায় তাই
                নিয়ে পড়লেন দোটানায়। কারণ, মনমতো কোনো জায়গা পাওয়া যাচ্ছিলো
                না। প্রফেসর আবদুস সামাদের পূর্ব পরিচিত ও তৎকালীন চট্টগ্রাম
                কলেজ-এর অধ্যক্ষ আবু হেনার সাথে এই বিষয়ে আলাপ করতে গেলে তিনি
                এটিকে তাঁর কলেজের একটি বিভাগ করার প্রস্তাব দেন।
              </p>
            </div>
          </div>
          <div
            tabIndex={0}
            className="collapse collapse-plus border border-base-300 bg-base-100 rounded-box"
          >
            <div className="collapse-title text-xl font-medium">
              Focus me to see content
            </div>
            <div className="collapse-content">
              <p>
                ১৯৪৭ সালে দেশ বিভাগের পর কলকাতার ‘দি কমার্শিয়াল ইনস্টিটিউট’-এর
                এক চতুর্থাংশ হিস্যা পাকিস্তানে স্থানান্তরিত হলে সেটির দায়িত্ব
                প্রফেসর আবদুস সামাদ-কে দেওয়া হয়। তিনি অনেক চিন্তা-ভাবনা করে
                অবশেষে নবগঠিত পূর্ব পাকিস্তানের বাণিজ্য নগরী চট্টগ্রামকে বেছে
                নেন। কমার্শিয়াল ইনস্টিটিউটের ভাগে পাওয়া টাইপ রাইটার, বই, ফাইল
                এবং অন্যান্য যন্ত্রপাতি নিয়ে তিনি চট্টগ্রামের উদ্দেশ্যে রওনা
                হন। চট্টগ্রামে এসে প্রফেসর সামাদ কোথায় এটি স্থাপন করা যায় তাই
                নিয়ে পড়লেন দোটানায়। কারণ, মনমতো কোনো জায়গা পাওয়া যাচ্ছিলো
                না। প্রফেসর আবদুস সামাদের পূর্ব পরিচিত ও তৎকালীন চট্টগ্রাম
                কলেজ-এর অধ্যক্ষ আবু হেনার সাথে এই বিষয়ে আলাপ করতে গেলে তিনি
                এটিকে তাঁর কলেজের একটি বিভাগ করার প্রস্তাব দেন।
              </p>
            </div>
          </div>
          <div
            tabIndex={0}
            className="collapse collapse-plus border border-base-300 bg-base-100 rounded-box"
          >
            <div className="collapse-title text-xl font-medium">
              Focus me to see content
            </div>
            <div className="collapse-content">
              <p>
                ১৯৪৭ সালে দেশ বিভাগের পর কলকাতার ‘দি কমার্শিয়াল ইনস্টিটিউট’-এর
                এক চতুর্থাংশ হিস্যা পাকিস্তানে স্থানান্তরিত হলে সেটির দায়িত্ব
                প্রফেসর আবদুস সামাদ-কে দেওয়া হয়। তিনি অনেক চিন্তা-ভাবনা করে
                অবশেষে নবগঠিত পূর্ব পাকিস্তানের বাণিজ্য নগরী চট্টগ্রামকে বেছে
                নেন। কমার্শিয়াল ইনস্টিটিউটের ভাগে পাওয়া টাইপ রাইটার, বই, ফাইল
                এবং অন্যান্য যন্ত্রপাতি নিয়ে তিনি চট্টগ্রামের উদ্দেশ্যে রওনা
                হন। চট্টগ্রামে এসে প্রফেসর সামাদ কোথায় এটি স্থাপন করা যায় তাই
                নিয়ে পড়লেন দোটানায়। কারণ, মনমতো কোনো জায়গা পাওয়া যাচ্ছিলো
                না। প্রফেসর আবদুস সামাদের পূর্ব পরিচিত ও তৎকালীন চট্টগ্রাম
                কলেজ-এর অধ্যক্ষ আবু হেনার সাথে এই বিষয়ে আলাপ করতে গেলে তিনি
                এটিকে তাঁর কলেজের একটি বিভাগ করার প্রস্তাব দেন।
              </p>
            </div>
          </div>
          <div
            tabIndex={0}
            className="collapse collapse-plus border border-base-300 bg-base-100 rounded-box"
          >
            <div className="collapse-title text-xl font-medium">
              Focus me to see content
            </div>
            <div className="collapse-content">
              <p>
                ১৯৪৭ সালে দেশ বিভাগের পর কলকাতার ‘দি কমার্শিয়াল ইনস্টিটিউট’-এর
                এক চতুর্থাংশ হিস্যা পাকিস্তানে স্থানান্তরিত হলে সেটির দায়িত্ব
                প্রফেসর আবদুস সামাদ-কে দেওয়া হয়। তিনি অনেক চিন্তা-ভাবনা করে
                অবশেষে নবগঠিত পূর্ব পাকিস্তানের বাণিজ্য নগরী চট্টগ্রামকে বেছে
                নেন। কমার্শিয়াল ইনস্টিটিউটের ভাগে পাওয়া টাইপ রাইটার, বই, ফাইল
                এবং অন্যান্য যন্ত্রপাতি নিয়ে তিনি চট্টগ্রামের উদ্দেশ্যে রওনা
                হন। চট্টগ্রামে এসে প্রফেসর সামাদ কোথায় এটি স্থাপন করা যায় তাই
                নিয়ে পড়লেন দোটানায়। কারণ, মনমতো কোনো জায়গা পাওয়া যাচ্ছিলো
                না। প্রফেসর আবদুস সামাদের পূর্ব পরিচিত ও তৎকালীন চট্টগ্রাম
                কলেজ-এর অধ্যক্ষ আবু হেনার সাথে এই বিষয়ে আলাপ করতে গেলে তিনি
                এটিকে তাঁর কলেজের একটি বিভাগ করার প্রস্তাব দেন।
              </p>
            </div>
          </div>
        </div>
      </div>
    </div>
  );
};

export default AboutUs;
